In [1]:
import pandas as pd
dataset = pd.read_csv('a_selection_example_1.csv')
dataset

     n  val1  val2 val3
0  100    10    10    C
1  101    10    20    C
2  102    10    30    B
3  103    10    40    B
4  104    10    50    A

### 可以指定列n是索引列

In [3]:
dataset = pd.read_csv('a_selection_example_1.csv', index_col=0)
dataset

     val1  val2 val3
n
100    10    10    C
101    10    20    C
102    10    30    B
103    10    40    B
104    10    50    A

In [4]:
dataset['val3'][104]

'A'

In [6]:
dataset.loc[104, 'val3']

'A'

In [8]:
dataset.loc(104)

In [12]:
dataset.iloc[4,2]

'A'

### 以下三种命令方式等价

In [13]:
dataset[['val3', 'val2']][0:2]

    val3  val2
n
100    C    10
101    C    20

In [14]:
dataset.loc[range(100, 102), ['val3', 'val2']]

    val3  val2
n
100    C    10
101    C    20

In [15]:
dataset.iloc[range(2), [2,1]]

    val3  val2
n
100    C    10
101    C    20